var albums = [
    { title: 'அப்பா பிதாவே', src: 'foaMlrWjex8', content: `அப்பா பிதாவே எகேவா தேவா
உம் தயை இருந்தாலே என் வாழ்வில் இன்பம்-2

பலத்த கரத்தால் விடுவிப்பேன் என்று
வல்லவர் வாக்கு பகிர்ந்தீர் ஐயா-2
என்னாலே ஒன்றும் இல்லை என் தேவா
எல்லாமே உம்மாலே ஆகும் என் மூவா-2

எகோவா யீரே என் தெய்வம் நீரே
எல்லாவற்றையும் பார்த்துக் கொள்வீரே-2
என்னாலே ஒன்றும் இல்லை என் தேவா
எல்லாமே உம்மாலே ஆகும் என் மூவா-2

எகேவா நிசி என்னையும் நேசி
சத்துருவின் தெல்லை இனிமேல் எனக்கில்லை-2
என்னாலே ஒன்றும் இல்லை என் தேவா
எல்லாமே உம்மாலே ஆகும் என் மூவா-2

எபிநேசர் இயேசு என் வாழ்வை பார்த்து
இம்மட்டும் உதவி செய்தீரே காத்து-2
என்னாலே ஒன்றும் இல்லை என் தேவா
எல்லாமே உம்மாலே ஆகும் என் மூவா-2

யோகாவா ஷாலோம் சமாதான தேவன்
சமாதானம் எனக்கு அளித்த மெய் தேவன்-2
என்னாலே ஒன்றும் இல்லை என் தேவா
எல்லாமே உம்மாலே ஆகும் என் மூவா-2` },
    { title: 'நீரில்லா வாழ்வு ஏது', src: 'c9lowido7Hw', content: `நீரில்லா வாழ்வு ஏது
நின் அன்பில்லா  ஜீவன் ஏது
இயேசுவே இயேசுவே இயேசுவே

மெய்யில்லா வாழ்வு ஏதற்கு
பொய்யான வாழ்வு எனது..2
மெய்யான வாழ்வு தேவை..2
மெய்யான ஒளியே உமது
இயேசுவே இயேசுவே இயேசுவே

நீரில்லா உலகம் ஏது
நினைத்து நான் பார்த்த போது..2
நீரே உலகின் ஒளியாய்..2
கொடுத்திட்டாய் வாழ்வை பலியாய்
இயேசுவே இயேசுவே இயேசுவே

பாவத்தில் வாழ்ந்த என்னை
பாசத்தால் அன்பாய் அழைத்தீர்..2
நானும் வாழ்வு காண..2
கண்ணீரை சிந்தினீரே
இயேசுவே இயேசுவே இயேசுவே

ஓடினேன் காடு மேடு
என்னை தேடினீர் ஐPவன் தந்து..2
பாடுவேன் அன்புக் கூர்ந்து..2
உம் கிருபையை தேடிவந்து
இயேசுவே இயேசுவே இயேசுவே

மெய்யான தெய்வம் நீரே
மெய்ப்பொருள் ஞானம் நீரே..2
காணுவேன் உந்தன் மீட்பு..2
பாடுவேன் நீசன் நானும்
பாடுவேன் தேவ தாசன் நானும்
இயேசுவே இயேசுவே இயேசுவே` },
    { title: 'நன்றி நன்றி என்று சொல்லி', src: 'djkflgn74Xw', content: `நன்றி நன்றி என்று செல்லி
நாதன் இயேசு பேரை சொல்லி
பாடிடுவேன் நான் பாடிடுவேன்

எத்தனான என்னையவர் 
பக்தனாக மாற்றியதால்
எப்போதும் பாடிடுவேன்..2 அவர் புகழ்
சொல்லி துதித்திடுவேன்

எத்தனையோ துரேகம் 
எந்தன் வாழ்வினிலே கண்டபோது 
அன்பாலே நேசித்தீரே..2 என்னை
அள்ளி அனைத்தீரே

எந்தன் பாவம் எல்லாம் 
தீர உந்தன் இரத்தம் சீந்தினீரே
எப்படி நான் மறவேன்..2 உம்மை
அன்னையென்று நான் புகழ்வேன்

பரிசுத்த அன்பை வேண்டி 
உந்தன் ஆவி என்னில் தந்தீர்
பரிசுத்தரை மறவேன்..2 பாவ
வாழ்வதை நான் வெறுப்பேன்

துதி துதி என்று சொல்லி 
தூயவரின் பேரை சொன்னால்
துன்பமெல்லாம் நீங்கீவிடும்..2 நம்
துயரமெல்லாம் மாறிவிடும்` },
    { title: 'இயேசுவே புவியில்', src: 'ORo02w9Twpc', content: `இயேசுவே பூவில் வந்திரே என் வாழ்வை
செழிக்கவே ஜீவன் தந்தீரே
ஆமென் அல்லேலூயா-4

வருந்தியே சுமக்கும் பாரமே-உந்தன்
வாழ்கையை நரகமாக்குமே
இருதய நாதன் இயேசுவே-எந்தன்
இருதயத்தின் இனிய நேசமே
ஆமென் அல்லேலூயா-4

வியாதிகள் துன்பம் வந்தாலும்-வேண்டாம்
இன்னொரு தேவன் என்றாரே
காயங்கள் எற்றுக் கொண்டாரே-நமக்காய்
கருணையின் வேந்தனவரே
ஆமென் அல்லேலூயா-4

பாவங்கள் போக்கவந்தீரே-புவியின்
பாவங்கள் தீர்த்து வீட்டீரே
பாவத்தில் மீட்பு தந்துமே-பரமன்
இராஜ்ஜியத்தில் பங்குதந்தீரே
ஆமென் அல்லேலூயா-4
` },
    { title: 'மணாளனே மா பிரபுவே', src: 'uW5YDy8bzPM', content: `மணாளனே மா பிரபுவே
மாறா மாறா இயேசு தேவனே-2

கீத வாத்திய சத்தம் முழங்குதே
கின்னரங்கள் தாளம் போடுதே
மேளதாள வாத்தியங்கள்
மனமகிழ வைக்குதே
பரலோகம் கொண்டு செல்லுதே
என் பரமனையே பார்க்க செய்யுதே

எக்காள சத்தம் தொனிக்கதே
இன்னல்கள் நீங்கி போகுதே
மணவாளியாக நான்
நடுவானில் சந்திப்பேன்
மணவாளன் இயேசு மீதிலே
சாய்ந்து நானும் இளைப்பாறுவேன்

இயேசு ராஐன் இன்னல் நீக்குவார்
வெற்றி என்னை சிறக்க செய்குவார்
சிலுவை மீது தொங்கியே
வெற்றி எனக்கு தந்தாரே
வெற்றி வேந்தன் இயேசு ராஐனே
வெற்றியென்னை காண செய்தீரே

ஆவியை எனக்கு தந்தாரே
அருள் வரங்களும் கூடத் தந்தாரே
ஆடுவேன் பாடுவேன்
அன்பரை நான் பேற்றுவேன்
மார்போடு அனைத்து கொள்வாரே
மன மகிழ்ச்சி தந்ததிடுவாரே

கோத்திரங்கள் கூடி துதிக்குதே
கேதாரினில் சத்தம் தொனிக்குதே
இன்பமே என் இயேசுவே 
எல்லையில்லா அன்பு பொங்குதே
இதயமெல்லாம் பொங்கி வழியுதே
` },
    { title: 'பிறந்தார் ஆமென்', src: 'g11jDn7YjvE', content: `பிறந்தார் ஆமென் பிறந்தார்
என் உள்ளத்தில் இன்றேசு பிறந்தார் (2)

ஆமென் அல்லேலூயா (4)

தூதர்கள் தரிசிக்க பிறந்தார் - வான
சாஸ்திரிகள் சாஷ்டாங்கமாய் பணிந்தார் (2)
பாவத்தில் வாழ்வோரை மீட்க - என்
உள்ளத்தில் இன்றேசு பிறந்தார் (2)

குஷ்டரை குணமாக்க பிறந்தார்
கூன் குருடரின் நலம் காக்க பிறந்தார்
பரிகாரியான தேவன் - என்
உள்ளத்தில் இன்றேசு பிறந்தார் (2)

சகேயுவை சந்திக்க பிறந்தார் - செத்த
லாசுருக்கு உயிர்க்கொடுக்க பிறந்தார்
சிலுவையில் மரித்த தேவன்
உள்ளத்தில் இன்றேசு பிறந்தார் (2)

இரட்சிப்பை கொடுத்திட பிறந்தார்
மனமாற்றி குணமாக்க பிறந்தார்
இராஜாதி இராஜனாம் தேவன் - என்
உள்ளத்தில் இன்றேசு பிறந்தார் (2)` },
    { title: 'என்னேசுவே என் பொன்னேசுவே', src: '5_F_zP7RiFg', content: `என்னேசுவே என் பொன்னேசுவே
ஏதேனில் ஆதிமனம் தந்தயேசுவே (2)

உன்னத தேவன் நீர் உண்மையான தேவன்
உலகுக்கு தன்னையர்பனித்த தேவன்
ஆமென் ஆல்லேலூயா (4)
அன்புமிக்க அண்ணலேசு அவர் பெயரே

சபையினில் உம்மை சாட்சியாக சொல்ல
சத்திய ஆவியென்னில் தந்த தேவன்
ஆமென் ஆல்லேலூயா (4)
அன்பரின் நாமம் அதிசயமே

கொல்கதா மீது கோரக்காட்சியாக
சிலுவையில் தொங்கி சீர்வாழ்வு தந்தீர்
ஆமென் ஆல்லேலூயா (4)
அன்பரின் தியாகம் உண்மையிதே

மங்களமான மணவாளன்னேசு
மங்களமான மணவாட்டியென்னை
ஆமென் ஆல்லேலூயா (4)
முப்பிரி நூலினால் இணைத்தாரே
` },
    { title: 'கண்ணே முத்தே', src: 'jnIDZ1REOcg', content: `கண்ணே முத்தே மணியே அமுதே
கர்த்தர் இயேசுவின் அன்பின் வடிவே (2)

அன்பும் அருளும் ஆற்றலும் அறிவும்
ஆண்டவர் அளித்திடுவார் - இயேசு
ஆண்டவர் அளித்திடுவார்

உன்னையும் பெறவே உன் தாய் செய்தால்
பொருத்தனை ஒன்றினையே
ஆண்டவர் கேட்டார் அருளதைக் கொடுத்தார்
உன்னையும் ஈன்றிடவே - உன் தாய்
உன்னையும் ஈன்றிடவே

பண்பாய் உன்னை வளர்த்திட கிருபைப்
பனிப்போல் பொழிந்திடுதே
அன்பே அருளே வடிவே மொழியே
ஆண்டவர் வருவாரே - இயேசு
ஆண்டவர் வருவாரே

பார்த்தேன் பார்த்தேன் பலநாள் பார்த்தேன்
பாசத்தை கூட்டி வைத்தேன்
இந்திர நீலம் சந்திர காந்தம் மரகதமே மணியே
வாழ்த்துக்கிறேன் கண்னே - நீ
வாழ்ந்திடுவாய் வளமாய்
` },
    { title: 'பாடுங்கள் இயேசுவை', src: 'opmdisl2iuU', content: `பாடுங்கள் இயேசுவை வாழ்த்தியே
தேடுங்கள் அன்பின் தேவனை

அல்லேலூயா (4)
ஆனந்தம் ஆனந்தமே அல்லேலூயா (2)

நல்லவர் இயேசுவை பாடுங்கள்
நன்மைகள் யாவும் செய்திடுவார்
வல்லவர் இயேசுவை தேடுங்கள்
வாழ்க்கையில் அமைதியும் ஈந்திடுவார்

லீலி புஷ்பமாம் இயேசுவை
அனுதினம் அவரை பாடுங்கள்
நீதியின் இராஜனாம் இயேசுவையே
தேடுங்கள் ஆறுதல் அளித்திடுவார்

காட்டு மரங்களில் கிச்சிலிப்போல்
என் தேவக்குமாரன் இருக்கிறார்
திராட்சை ரசத்தால் தேற்றுங்கள்
கிச்சிலி பழத்தால் ஆற்றுங்கள்

மணவாளியே என் மணவாளியே
இயேசு உன்னை அழைக்கின்றார்
மணவாளனாக இயேசுவே
நடுவானில் ஒருநாள் வந்திடுவார்
` },
    { title: 'வருவேன் என்றவர்', src: 'CLTkQ9QPf5A', content: `வருவேன் என்றவர் தாமதியாரே
வரும்நாளை எதிர்பார்ப்போம்
வந்தவர் நம்மை அழைத்து செல்வார்
ஆயத்தமாகிடுவோம்

எக்காள சத்தம் தொனித்திடவே
என்றும் அவரை துதித்திடவே
இன்னல்கள் எல்லாம் மறைந்திடுதே
வானமீதிலே தேவதேவனாய்
இராஜராஜனாய் வருவார்
இதுவே அவரின் வருகையாகும்
எனவே மனிதா மார்க்கமுண்டு
பாதுகாப்பு உண்டு

வானமானது வாடி போயிடும்
சுடர்களானது சுருங்கி போயிடும்
மேகமீதிலே தேவதேவனாய்
இராஜராஜனாய் வருவார்
இதுவே அவரின் வருகையாகும்
எனவே மனிதா மார்க்கமுண்டு
பாதுகாப்பு உண்டு
` }
];

videoTemplate = jQuery('#videoTemplate');
videoContainer = jQuery('#videoContainer');
videoContent = jQuery('#videoContent');
docTitle = document.title;

jQuery(function() {
    construct();
});

function construct() {
    jQuery(videoContainer).html('');
    jQuery(videoContent).html('');
    albums.forEach(function(item, index) {
        var video = jQuery(videoTemplate).clone(true);
        video.attr('id', md5(index)).show();
        video.find('a').attr('href', 'video-album.php?v=' + item.src).attr('data-index', md5(index)).on('click', handleVideoClick).text(item.title);
        videoContainer.append(video);
    });
    check();
};

function check() {
    if(window.location.search == "") {
        var el = jQuery(videoContainer).find('a:nth-child(1)').eq(0);
        window.history.pushState('video' + md5(0), el.text(), el.attr('href'));
        changeVideo(el);
    } else {
        for(var i = 0; i < albums.length; i++) {
            var item = albums[i];
            if(('video-album.php?v=' + item.src).indexOf(window.location.search) != -1) {
                var el = jQuery(videoContainer).find('a').eq(i);
                window.history.pushState('video' + md5(0), el.text(), el.attr('href'));
                changeVideo(el);
                break;
            }
        }
    }
};

function handleVideoClick(event) {
    var el = jQuery(event.currentTarget);
    changeVideo(el);
    event.preventDefault();
    event.stopPropagation();
    return false;
};

function changeVideo(el) {
    var index = el.attr('data-index');
    window.history.pushState('video' + index, el.text(), el.attr('href'));
    HTTP_GET = getQueryParams(window.location.search);
    var src = HTTP_GET['v'];
    jQuery(videoContent).html('');
    var h1 = jQuery('<h1>').text(el.text());
    var iframe = jQuery('<iframe width="640" height="360" src="https://www.youtube.com/embed/' + src + '" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>');
    var pre = jQuery('<pre>');
    for(var i = 0; i < albums.length; i++) {
        var item = albums[i];
        if(('video-album.php?v=' + item.src).indexOf(window.location.search) != -1) {
            pre.text(item.content);
            break;
        }
    }
    jQuery(videoContent).append(h1).append(iframe).append(pre);
    document.title = el.text() + ' | ' + docTitle;
};
